export let questions = [
  "Объясните делегирование событий.",

  "Объясните, как this работает в JavaScript? Можете ли вы привести пример одного из способов работы с this, которая изменилась в ES6?",

  "Объясните, как работает прототипное наследование.",

  "В чем разница между переменной null, undefined или undeclared? Как бы вы проверили любое из этих состояний?",

  "Что такое замыкание и как/почему вы его используете?",

  "Какие языковые конструкции вы используете для перебора свойств объекта и элементов массива?",

  "Можете ли вы описать основную разницу между циклом Array.forEach() и методами Array.map() и почему вы должны выбрать один, а не другой?",

  "Каков типичный вариант использования анонимных функций?",

  "В чем разница между хост-объектами и собственными объектами?",

  "Объясните разницу между: function Person(){}, var person = Person() и var person = new Person()?",

  "Объясните разницу в использовании foo между function foo() {} и var foo = function() {}",

  "Можете ли вы объяснить, что делают Function.call и Function.apply? В чем заметная разница между ними?",

  "Объясните Function.prototype.bind.",

  "В чем разница между обнаружением функций, выводом функций и использованием строки UA?",

  "Объясните hoisting.",

  "Опишите всплытие событий.",

  "Опишите захват событий.",

  "В чем разница между «атрибутом» и «свойством»?",

  "Каковы плюсы и минусы расширения встроенных объектов JavaScript?",

  "What is the difference between == and ===?",

  "Объясните Same-origin policy в отношении JavaScript.",

  "Почему он называется Тернарным оператором, что означает слово «Тернарный»?",

  "Что такое строгий режим? Каковы некоторые преимущества / недостатки его использования?",

  "Каковы некоторые преимущества/недостатки написания кода JavaScript на языке, который компилируется в JavaScript?",

  "Какие инструменты и методы вы используете для отладки кода JavaScript?",

  "Объясните разницу между изменяемым и неизменяемым объектом. Что является примером неизменяемого объекта в JavaScript? Каковы плюсы и минусы неизменности? Как добиться неизменности в собственном коде?",

  "Объясните разницу между синхронными и асинхронными функциями.",

  "Что такое цикл событий? В чем разница между стеком вызовов и очередью задач?",

  "В чем разница между переменными, созданными с помощью let, var или const?",

  "В чем разница между классом ES6 и конструкторами функций ES5?",

  "Можете ли вы предложить вариант использования нового синтаксиса arrow function =>? Чем этот новый синтаксис отличается от других функций?",

  "В чем преимущество использования синтаксиса стрелки для метода в конструкторе?",

  "Как определяется функция высшего порядка?",

  "Можете ли вы привести пример деструктуризации объекта или массива?",

  "Можете ли вы привести пример создания строки с помощью шаблонных литералов ES6?",

  "Можете ли вы привести пример curry function и почему этот синтаксис дает преимущество?",

  "Каковы преимущества использования синтаксиса spread и чем он отличается от синтаксиса rest?",

  "Как вы можете разделить код между файлами?",

  "Почему вы можете захотеть создать статические члены класса?",

  "В чем разница между циклами while и do-while в JavaScript?",

  "Что такое promise? Где и как вы бы использовали promise?",

  "Обсудите, как вы можете использовать принципы объектно-ориентированного программирования при кодировании с помощью JavaScript.",
];
